n = int(input("Введите число n: "))
a = str(n)
b = a + a
c = a + a + a
res = n + int(b) + int(c)
print("n + nn + nnn =", res)


"""
Задание 3.

Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn.

Пример:
Введите число n: 3
n + nn + nnn = 369
"""
